'use strict';

// Имена не повторяются – уникальны
module.exports = {
    'Дарья (Пиратка)': {
        name: 'Дарья (Пиратка)',
        gender: 'Женский',
        phone: '+70000000000',
        friends: ['Семён', 'Леонид', 'Полина']
    },
    'Даниил': {
        name: 'Даниил',
        gender: 'Мужской',
        phone: '+70000000000',
        friends: ['Светлана']
    },
    'Васян': {
        name: 'Васян',
        gender: 'Мужской',
        phone: '+70000000000',
        friends: ['Сергей', 'Леонид']
    },
    'Веня': {
        name: 'Веня',
        gender: 'Мужской',
        phone: '+70000000000',
        friends: ['Полина', 'Олег Олегыч']
    },
    'Семён': {
        name: 'Семён',
        gender: 'Мужской',
        phone: '+70000000000',
        friends: ['Пётр', 'Дарья (Пиратка)']
    },
    'Полина': {
        name: 'Полина',
        gender: 'Женский',
        phone: '+70000000000',
        friends: ['Сергей', 'Веня', 'Олег Олегыч', 'Дарья (Пиратка)']
    },
    'Олег Олегыч': {
        name: 'Олег Олегыч',
        gender: 'Мужской',
        phone: '+70000000000',
        friends: ['Полина', 'Веня']
    },
    'Сергей': {
        name: 'Сергей',
        gender: 'Мужской',
        phone: '+70000000000',
        friends: ['Васян', 'Полина']
    },
    'Леонид': {
        name: 'Леонид',
        gender: 'Мужской',
        phone: '+70000000000',
        friends: ['Пётр', 'Васян', 'Дарья (Пиратка)']
    },
    'Светлана': {
        name: 'Светлана',
        gender: 'Женский',
        phone: '+70000000000',
        friends: ['Пётр', 'Даниил']
    },
    'Пётр': {
        name: 'Пётр',
        gender: 'Мужской',
        phone: '+70000000000',
        friends: ['Светлана', 'Леонид', 'Семён']
    },
    'Слава': {
        name: 'Слава',
        gender: 'Мужской',
        phone: '+70000000000',
        friends: []
    }
};
